benchmark_serving.txt
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/data/jieni/workspace/datastes/ShareGPT_Vicuna_unfiltered/ShareGPT_V3_unfiltered_cleaned_split.json', model='/data/jieni/workspace/code/inference-toolboxes/hf_experimanets/Llama-2-7b-chat-hf', tokenizer='/data/jieni/workspace/code/inference-toolboxes/hf_experimanets/Llama-2-7b-chat-hf', best_of=1, use_beam_search=False, num_prompts=2000, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, request_rate=inf, seed=0, trust_remote_code=False, disable_tqdm=False, save_result=True, metadata=None, result_dir=None, result_filename=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 2000/2000 [07:44<00:00,  4.31it/s]
============ Serving Benchmark Result ============
Successful requests:                     2000      
Benchmark duration (s):                  464.48    
Total input tokens:                      508434    
Total generated tokens:                  386724    
Request throughput (req/s):              4.31      
Input token throughput (tok/s):          1094.64   
Output token throughput (tok/s):         832.60    
---------------Time to First Token----------------
Mean TTFT (ms):                          166204.67 
Median TTFT (ms):                        173566.98 
P99 TTFT (ms):                           406719.26 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          332.04    
Median TPOT (ms):                        300.87    
P99 TPOT (ms):                           940.27    
---------------Inter-token Latency----------------
Mean ITL (ms):                           606.71    
Median ITL (ms):                         456.33    
P99 ITL (ms):                            1905.23   
==================================================